tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/0.org/include/fixedInlet
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

inlet
{
    type  fixedValue;
    value $internalField;
}

// ************************************************************************* //
