tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/0.org/include/frontBackUpperPatches
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/

upperWall
{
    type symmetryPlane;
}

frontAndBack
{
    type symmetryPlane;
}

// ************************************************************************* //
