tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/0.org/nut
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    frontAndBack
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    lowerWall
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    upperWall
    {
        type            symmetryPlane;
        value           uniform 0;
    }
    "motorBike_.*"
    {
        type            nutUSpaldingWallFunction;
        value           uniform 0;
    }
    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
