tutorials/incompressible/pimpleSolver/les/motorBike/motorBikeSS/system/fvSolution
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-07;
        relTol          0.1;
        smoother        SSGS;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    algebraicPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
    }
    U
    {
        solver          smoothSolver;
        smoother        USGS;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    k
    {
        solver          smoothSolver;
        smoother        USGS;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    omega
    {
        solver          smoothSolver;
        smoother        USGS;
        tolerance       1e-08;
        relTol          0.1;
        nSweeps         1;
    }
    nuTilda
    {
        solver          smoothSolver;
        smoother        USGS;
        nSweeps         2;
        tolerance       1e-08;
        relT            0.1;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    p               0.3;
    U               0.5;
    k               0.7;
    omega           0.7;
    nuTilda         0.5;
}

cache
{
    grad(U)         ;
}


// ************************************************************************* //
